tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "heroku/brew"
# Core Utils
brew "bzip2"
brew "openblas"
brew "openssl@3"
brew "readline"
brew "wget"
brew "zlib"
brew "zsh"
#Command Line extras
brew "exa"
brew "xz"
brew "fzf"
# Databases and storage
brew "postgresql@14"
brew "sqlite"
brew "redis"
# Python
brew "pyenv"
#Ruby
brew "chruby"
brew "ruby-build"
brew "ruby-install"
#Node 
brew "nvm"
#Clis
brew "flyctl"
#Go
brew "go"
brew "golangci-lint"
#Casks
cask "raycast"
cask "warp"

