tap "homebrew/bundle"
tap "redis-stack/redis-stack"

# Core Utils
brew "bzip2"
brew "openblas"
brew "openssl@3"
brew "readline"
brew "wget"
brew "zlib"
brew "zsh"
brew "libpq"
#Command Line extras
brew "eza"
brew "xz"
brew "fzf"
brew "htop"
brew "direnv"
# Databases and storage
brew "postgresql@15"
brew "pgvector"

#redis with search
cask "redis-stack"

# Python
brew "pyenv"
brew "poetry"
brew "cmake"
brew "ruff"
brew "pipx"
brew "uv"
#mojo
brew "modular"
#Node 
brew "nvm"
#Clis
brew "flyctl"
brew "gh"
#Go
brew "go"
brew "golangci-lint"
brew "semgrep"
#Casks
cask "raycast"
cask "warp"
cask "qlstephen" #Quicklook plugin

