#Go
brew "go"
brew "golangci-lint"
brew "semgrep"

#Tools
brew "awscli"
brew "pre-commit"
brew "jq"
brew "git-flow"
brew "protobuf"

#rust
brew "rustup"

#temporal 
brew "tctl"

#Terraform
brew "terraform"
brew "tflint"

#frontend
brew "nginx"
brew "rover"

#Scipy
brew "openblas" 
brew "gfortran"

#Casks
cask "aws-vault"

#ci/cd
brew "act"

#Pulumi
brew "pulumi"