tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "snyk/tap"
# Core Utils
brew "bzip2"
brew "openblas"
brew "openssl@3"
brew "readline"
brew "wget"
brew "zlib"
brew "zsh"
brew "libpq"
#Command Line extras
brew "exa"
brew "xz"
brew "fzf"
brew "htop"
# Databases and storage
brew "postgresql@14"
brew "sqlite"
brew "redis"
# Python
brew "pyenv"
brew "poetry"
brew "cmake"
#Ruby
#brew "chruby"
#brew "ruby-build"
#brew "ruby-install"
#Node 
brew "nvm"
#Clis
brew "flyctl"
brew "snyk"
#Go
brew "go"
brew "golangci-lint"
brew "semgrep"
#Casks
cask "raycast"
cask "warp"
cask "qlstephen" #Quicklook plugin

#Elixir
brew "elixir"
brew "erlang"
# Additional files
# file ~/.Brewfile_Mountoux